Repository: fcollonval/Edware
Catalog: EdWare_src/locale/*/LC_MESSAGES/Edwarewxapp.po
Languages: fr

source: &File
fr: &Fichier

source: New
fr: Nouveau

source: Start a new program
fr: Commencer un nouveau programme

source: &Open
fr: &Ouvrir

source: Open an existing program
fr: Ouvrir un programme existant

source: Save the current program
fr: Enregistrer le programme actuel

source: &Save
fr: &Enregistrer

source: Save &As
fr: Enregistrer &Sous

source: Save the current program under a new name
fr: Enregistrer le programme actuel sous un nouveau nom

source: Exit EdWare
fr: Quitter EdWare

source: &Exit
fr: &Quitter

source: &Program Edison
fr: &Programme Edison

source: Program &Edison
fr: Programme &Edison

source: Program Edison
fr: Programme Edison

source: &Check program size
fr: &Vérifier la taille du programme

source: Report on the bytes and variables used in the program
fr: Rapport sur les bytes et variables utilisées dans le progamme

source: &Download new firmware
fr: &Charger le nouveau firmware

source: Download new firmware to Edison
fr: Charger le nouveau firmware sur Edison

source: &Help
fr: &Aide

source: Display help for Edison EdWare
fr: Afficher l'aide d'Edison EdWare

source: Display information about Edison EdWare
fr: Afficher les informations à propos d'Edison EdWare

source: &About
fr: A &propos

source: &New - Advanced
fr: &Nouveau - Avancé

source: &Advanced mode
fr: &Mode avancé

source: &Settings
fr: &Paramètres

source: Add Variable
fr: Ajouter une variable

source: &Program view
fr: Afficher le &programme

source: &View
fr: &Affichage

source: &Configuration view
fr: Afficher la &configuration

source: Download over audio
fr: Télécharger par audio

source: Download new FIRMWARE over audio
fr: Télécharger le nouveau FIRMWARE par audio

source: Unsaved program.
fr: Programme non-sauvegardé.

source: Open program
fr: Ouvrir un programme

source: EdWare files (*.edw)|*.edw|All files (*.*)|*.*
fr: Fichiers Edware (*.edw)|*.edw|Tous les fichiers (*.*)|*.*

source: Can't open the file: %s
fr: Ouverture du fichier %s impossible.

source: Error while opening program.
fr: Erreur lors de l'ouverture du programme.

source: Error opening the program. Maybe the disk vanished?
fr: Erreur à l'ouverture du programme. Le disque a peut-être disparu?

source: Exiting with a modified program.
fr: Quitte avec un programme modifié.

source: Your program has changes that have not been saved.
fr: Votre programme a des modifications non-sauvegardées.

source: Would you like to save the changes first?
fr: Voulez-vous enregistrer les changements?

source: Save program
fr: Enregistrer le programme

source: Exception:%s, python ver:%s
fr: Exception:%s; version python:%s

source: Error saving the program. Maybe the disk is full? (%s)
fr: Erreur à la sauvegarde du programme. Le disque est peut-être plein? (%s)

source: Error while saving.
fr: Erreur lors de la sauvegarde.

source: Please enter the USB device for programming the robot
fr: Entrer s'il vous plait l'appareil USB de programmation du robot

source: USB Device
fr: Appareil USB

source: Download via Screen
fr: Télécharger via Screen

source: Download via USB
fr: Télécharger via USB

source: Download new FIRMWARE via USB
fr: Télécharger le nouveau FIRMWARE via USB

source: Download Intel hex file via USB
fr: Télécharger le fichier Intel hex via USB

source: &Display toolbar
fr: &Affichage de la barre d'outil

source: &Strict version check
fr: &Vérification stricte de la version

source: EdWare Edison progamming environment
fr: Edware - environnement de programmation d'Edison

source: An optional edware file to load
fr: Une fichier edware optionnel à charger

source: Select a specific audio output if it's installed
fr: Sélection d'une sortie audio spécifique si elle est installée.

source: About Edison EdWare
fr: A propos d'Edison EdWare

source: <html> <body> <center> <h1>Edison EdWare</h1> <h2>Version 1.0.0</h2> Programming your Edison Robot<br> http://www.microbric.com/ </center> <p> <font size="-2"> Copyright 2006,2014,2015 Microbric Pty Ltd<br> This program is distributed under the terms of the Gnu General Public License, version 2 (for the full text, see gpl.txt in the docs directory) </font> <p> <font size="1"> Author: Brian Danilko, <b>Likeable Software</b> (http://www.likeablesoftware.com) </font> </p> <p> <font size="1"> Made possible by awesome Edison firmware by: Bill Hammond, <b>Circuitworks</b> </font> </p> <p> <font size="-2"> This program, and previous versions, were developed using the following open-source components: <ul> <li><b>Python</b> (http://www.python.org) <li><b>wxPython</b> (http://www.wxpython.org) <li><b>pyWin32</b> (http://pywin32.sourceforge.net) <li><b>pyInstaller</b> (http://www.pyinstaller.org) <li><b>Inno Setup</b> (http://www.jrsoftware.org) <li><b>JsonPickle</b> (http://jsonpickle.github.io) <li><b>PyAudio</b> (http://people.csail.mit.edu/hubert/pyaudio) <li>----------- previous version components ---------------- <li><b>pySerial</b> (http://pyserial.sourceforge.net) <li><b>comscan.py</b> from bitpim (http://www.bitpim.org) </font> </ul> </body> </html>
fr: <html> <body> <center> <h1>Edison EdWare</h1> <h2>Version 1.0.0</h2> Programme ton Robot Edison<br> http://www.microbric.com/ </center> <p> <font size="-2"> Copyright 2006,2014,2015 Microbric Pty Ltd<br> Ce programme est distribué selon les conditions de la GNU General Public License, version 2 (le texte complet est disponible dans le fichier gpl.txt du dossier docs) </font> <p> <font size="1"> Auteur: Brian Danilko, <b>Likeable Software</b> (http://www.likeablesoftware.com) </font> </p> <p> <font size="1"> Rendu possible par l'exceptionnel firmware Edison de: Bill Hammond, <b>Circuitworks</b> </font> </p> <p> <font size="-2"> Ce programme et les versions précédentes sont développées à partir des composants open-source suivants: <ul> <li><b>Python</b> (http://www.python.org) <li><b>wxPython</b> (http://www.wxpython.org) <li><b>pyWin32</b> (http://pywin32.sourceforge.net) <li><b>pyInstaller</b> (http://www.pyinstaller.org) <li><b>Inno Setup</b> (http://www.jrsoftware.org) <li><b>JsonPickle</b> (http://jsonpickle.github.io) <li><b>PyAudio</b> (http://people.csail.mit.edu/hubert/pyaudio) <li>----------- versions précédentes des composants ---------------- <li><b>pySerial</b> (http://pyserial.sourceforge.net) <li><b>comscan.py</b> de bitpim (http://www.bitpim.org) </font> </ul> </body> </html>

source: Okay
fr: Ok

source: Edison EdWare Help
fr: Aide d'Edison EdWare

source: <html> <body> <center> <h1>Edison EdWare Help</h1> </body> </html>
fr: <html> <body> <center> <h1>Aide d'Edison EdWare</h1> </body> </html>

source: Cancel
fr: Annuler

source: Error loading
fr: Erreur lors du chargement

source: Module Label
fr: Etiquette du module

source: Module Configuration
fr: Configuration du module

source: Edit module name
fr: Editer le nom du module

source: The module name '%s' is already used
fr: Le nom de la variable '%s' est déjà utilisé.

source: Module names must start with a character and are at most 16 characters long
fr: Les noms de modules doivent commencer par un caractère et ne peuvent faire plus de 16 caractères.

source: Error editing module name.
fr: Erreur à l'édition du nom du module.

source: Location:
fr: Emplacement:

source: Module Label:
fr: Etiquette du module:

source: Can not delete the device as it is used in the program. Delete it from the program before deleting it here.
fr: L'appareil ne peut pas être supprimé car il est utilisé dans le programme. Supprime le du programme avant de le supprime ici.

source: Can't delete device.
fr: L'appareil ne peut être supprimé.

source: <-Constant
fr: <-Constante

source: -No Variable-
fr: -Pas de variables-

source: Clear screen
fr: Effacer l'écran

source: Scroll line
fr: Barre de défilement

source: multiply
fr: multiplier

source: not (bitwise)
fr: non (bit à bit)

source: divide
fr: diviser

source: and (bitwise)
fr: et (bit à bit)

source: or (bitwise)
fr: ou (bit à bit)

source: xor (bitwise)
fr: ou exclusif (bit à bit)

source: Control:
fr: Contrôle:

source: Save changes
fr: Enregistrer les modifications

source: Undo changes
fr: Annuler les modifications

source: A (6th)
fr: A (6e)

source: A# (6th)
fr: A# (6e)

source: B (6th)
fr: B (6e)

source: C (8th)
fr: C (8e)

source: Rest
fr: Pause

source: eighth
fr: huitième

source: half
fr: demi

source: quarter
fr: quart

source: sixteenth
fr: seizième

source: whole
fr: entière

source: On reflective surface
fr: Sur une surface réflective

source: On non-reflective surface
fr: Sur une surface non-réflective

source: Keypad
fr: Touches

source: Triangle button pressed
fr: Appui sur le bouton triangle

source: Round button pressed
fr: Appui sur le bouton rond

source: Countdown timer
fr: Minuterie

source: Timer finished
fr: Temps écoulé

source: Drive
fr: Déplacement

source: Music
fr: Musique

source: Tune finished
fr: Fin de la mélodie

source: Detect clap
fr: Détection de sons

source: Clap detected
fr: Son détecté

source: Data from another Edison
fr: Donnée reçue d'un autre Edison

source: IR Character
fr: IR caractère

source: Detect obstacle
fr: Détection des obstacles

source: Obstacle at front
fr: Obstacle devant

source: Obstacle at left
fr: Obstacle à gauche

source: Obstacle at right
fr: Obstacle à droite

source: Any Obstacle detected
fr: Un obstacle détecté

source: Data from TV remote
fr: Donnée reçue d'une télécommande

source: Line Tracker
fr: Suivi de lignes

source: Any change
fr: N'importe quel changement

source: Forward
fr: Avancer

source: Stop
fr: Arrêter

source: Backward
fr: Reculer

source: Forward right
fr: Avancer vers la droite

source: Forward left
fr: Avancer vers la gauche

source: Back left
fr: Reculer à gauche

source: Back right
fr: Reculer à droite

source: Spin right
fr: Tourner dans le sens des aiguilles d'une montre

source: Spin left
fr: Tourner dans le sens contraire des aiguilles d'une montre

source: Turn right 90
fr: Tourner à droite de 90 degrés

source: Turn left 90
fr: Tourner à gauche de 90 degrés

source: Constant
fr: Constante

source: %s - properties:
fr: %s - propriétés:

source: Musical note
fr: Note musicale

source: Tune string
fr: Mélodie

source: Too many tune notes/durations (max 16 pairs).
fr: Trop de notes de musiques/durées (max. 16 paires)

source: Tune string is not valid. Check help for the format.
fr: La mélodie n'est pas valide. Vérifie l'aide pour le format.

source: Off
fr: Eteint

source: On
fr: Allumé

source: LED Setting:
fr: Paramètres LED:

source: IR Transmitter obstacle detection:
fr: Transmetteur IR détection d'obstacle:

source: Line Tracker LED:
fr: Détecteur de ligne LED:

source: Sleep:
fr: Pause:

source: Character to send:
fr: Caractère à envoyer:

source: Variable to read into:
fr: Variable à lire:

source: Left light level
fr: Niveau de lumière gauche

source: Right light level
fr: Niveau de lumière droit

source: Line light level
fr: Niveau de lumière de la ligne

source: Sense:
fr: Sens:

source: Left drive
fr: Moteur gauche

source: Right drive
fr: Moteur droit

source: Read distance from:
fr: Lit la distance depuis :

source: Seconds:
fr: Secondes :

source: Range is 0.00 to 327.67 seconds.
fr: L'intervalle va de 0.00 à 327.67 secondes.

source: Max time to wait:
fr: Temps d'attente maximum:

source: Variable for pulse time:
fr: Variable pour le temps du pulse :

source: Range for times is 0.00 to 327.67
fr: L'intervalle de temps va de 0.00 à 327.67

source: Output Level:
fr: Niveau de sortie :

source: Duration:
fr: Durée :

source: Plus 1 to variable
fr: Ajouter 1 à la variable

source: Minus 1 from variable
fr: Retirer 1 à la variable

source: Value:
fr: Valeur:

source: Variable to set:
fr: Variable à définir:

source: Copy data from variable:
fr: Copier la donnée à partir de la variable:

source: Copy data to variable:
fr: Copier la donnée depuis la variable:

source: Unlimited - Forever
fr: Sans limites - à jamais

source: Millimetres - in 2.5mm steps
fr: Millimètres - par pas de 2,5mm

source: Inches - in inch steps
fr: Pouces - par pas de 1 pouce

source: Degrees - in 7.5 degree steps
fr: Degrés - par pas de 7,5 degrés

source: Speed:
fr: Vitesse:

source: Basic
fr: Basique

source: Divide
fr: Diviser

source: Logical
fr: Logique

source: Operation:
fr: Opération :

source: HELLO WORLD
fr: BONJOUR LE MONDE

source: String:
fr: Chaine de caractères :

source: Row / Column:
fr: Ligne / Colonne :

source: Character:
fr: Caractère:

source: Number:
fr: Nombre :

source: Command:
fr: Commande :

source: Dark
fr: Sombre

source: Light
fr: Clair

source: Set pixel to:
fr: Définit le pixel à :

source: At row / column:
fr: A la ligne / colonne :

source: good_choices:
fr: bon_choix :

source: Event happens:
fr: L'évènement se produit :

source: Event happens
fr: L'évènement se produit

source: Wait Until:
fr: Attendre jusqu'à :

source: Loop forever
fr: Boucle indéfiniment

source: Test passes
fr: Test réussi

source: Loop UNTIL:
fr: Boucle JUSQU'A :

source: Take the top (True) branch if:
fr: Prend la branche supérieure (Vrai) si :

source: Else take the bottom (False) branch.
fr: Sinon prend la branche inférieure (Faux).

source: ERROR - No Audio package (pygame or pyaudio) installed!
fr: ERREUR - Pas de package audio (pygame ou pyaudio) installé!

source: unknown
fr: inconnu

source: (Audio installed: %s
fr: (Audio installé : %s

source: ERROR - selected audio 'portaudio' is not installed!
fr: ERREUR - l'audio sélectionné 'portaudio' n'est pas installé!

source: ERROR - selected audio 'pygame' is not installed!
fr: ERREUR - l'audio 'pygame' sélectionné n'est pas installé!

source: ERROR - selected audio '%s' is unknown!
fr: ERREUR - l'audio sélectionné '%s' est inconnu!

source: - Audio to be used: %s)
fr: - L'audio utilisé sera : %s)

source: Program size (bytes): %d
fr: Taille du programme (en octet) : %d

source: Variables (%s) used: %d, max: %d
fr: Variables (%s) utilisée : %d, max: %d

source: Program Size
fr: Taille du programme

source: Set Title!
fr: Définir un titre!

source: USB Device:
fr: Appareil USB :

source: Download progress:
fr: Progression du téléchargement :

source: Start Download
fr: Commencer le téléchargement

source: Cancel Download
fr: Annuler le téléchargement

source: Download size is %d bytes.
fr: Taille du téléchargement est de %d octets.

source: Starting download of %d bytes.
fr: Début du téléchargement de %d octets.

source: Downloading was successful!
fr: Téléchargement accompli!

source: Finished downloading
fr: Fin du téléchargement

source: Firmware File:
fr: Fichier firmware :

source: Find a Firmware File
fr: Trouver un fichier Firmware

source: Error - couldn't read file: %s
fr: Error - le fichier '%s' ne peut être lu

source: Creating audio file.
fr: Création du fichier audio.

source: Finished Downloading!
fr: Téléchargement terminé!

source: Downloading %d bytes.
fr: Téléchargement de %d octets.

source: Error - file doesn't seem to be firmware.
fr: Erreur - le fichier ne semble pas être un firmware.

source: Doesn't look like an intel hex file
fr: Ne ressemble pas à un fichier intel hex

source: Line too short
fr: Ligne trop courte

source: Invalid digits
fr: Chiffres invalides

source: Error in reading intel hex file:
fr: Erreur à la lecture du fichier intel hex :

source: Intel Hex File:
fr: Fichier Intel Hex :

source: Find an Intel Hex File
fr: Trouver un fichier Intel Hex

source: Hex files (*.hex)|*.hex|All files (*.*)|*.*
fr: Hex files (*.hex)|*.hex|Tous les fichiers (*.*)|*.*

source: Error on reading intel hex file:
fr: Erreur à la lecture d'un fichier Intel Hex :

source: Debug: in convert() with binString of length
fr: Debug : dans 'convert()' avec un binString de taille

source: ..debug: coding value
fr: ..debug : valeur d'encodage

source: Help
fr: Aide

source: Locations:
fr: Positions:

source: Register names (offset/bytes):
fr: Noms du registre (offset/octets):

source: Unknown device type:
fr: Type d'appareil inconnu :

source: Location (%d) outside of 0 to 11
fr: Position (%d) en dehors de l'intervalle 0-11

source: Location (%d) is already used with a unit of type:
fr: Position (%d) est déjà utilisé avec l'unité de type :

source: DEVICE name can not be one of the built-in names
fr: Le nom d'un appareil (DEVICE) ne peut être un nom enregistré

source: DEVICE name already used:
fr: Le nom de l'appareil (DEVICE) est déjà utilisé :

source: A tracker device can only be located at 0, not location %d
fr: Un appareil de suivi ne peut être placé qu'en 0 et pas en position %d

source: Motors require two locations yet the second location is already used with a
fr: Les moteurs requièrent deux positions. Or la seconde position est déjà utilisée par un

source: Device mappings:
fr: Correspondance des appareils :

source: , name:%s
fr: , nom:%s

source: Expected an argument or constant!
fr: Requière un argument ou une constante!

source: Expected an argument or string!
fr: Requière un argument ou une chaine de caractères!

source: Word should have been a valid name!
fr: Un mot doit avoir un nom valide!

source: {Word: %s,%s}
fr: {Mot: %s,%s}

source: Error - use single quotes for an ascii constant
fr: Erreur - utilise les guillemets simples pour une constante ASCII

source: Invalid mod/reg syntax:
fr: Syntaxe mod/reg invalide :

source: Didn't understand the module name/number:
fr: Nom/numéro du module incompris :

source: Didn't understand the register name/number:
fr: Nom/numéro du registre incompris :

source: Error - can't parse %s as a modreg
fr: Erreur - %s ne peut être décomposé en un modreg

source: Error - group name (%s) not found
fr: Erreur - Nom de groupe (%s) non trouvé

source: Unsupported platform -
fr: Plateformes non supportées

source: Bric %d - p:%d, n:%d, p2:%d, n2:%d name:%s, if_var: %s, data:%s
fr: Bric %d - p:%d, n:%d, p2:%d, n2:%d nom:%s, if_var: %s, données:%s

source: Streams:
fr: Flux :

source: Bric count:
fr: Nombre de brics :

source: WARNING - old bric id:
fr: ATTENTION - ancien id de la bric :

source: ERROR - file %s doesn't exist or isn't readable
fr: ERREUR - le fichier %s n'existe pas ou n'est pas lisible

source: Insert history:
fr: Insère l'historique :

source: Move size:%d, words:%s
fr: Taille du déplacement : %d, mots : %s

source: Move needs 2 arguments
fr: Déplacer requière 2 arguments

source: Initial Value
fr: Valeur initiale

source: Name
fr: Nom

source: Range
fr: Intervalle

source: <NEW>
fr: <NOUVEAU>

source: Edit variable
fr: Editer la variable

source: Add variable
fr: Ajouter une variable

source: Variable name '%s' is used in the program.
fr: Le nom de variable '%s' est utilisé dans le programme.

source: Change the program before removing this variable.
fr: Modifier le programme avant de retirer cette variable.

source: Variable name '%s' is already used.
fr: Le nom de la variable '%s' est déjà utilisé.

source: Variable names must start with a character and are at most 16 characters long
fr: Les noms de variables doivent commencer par un caractère et ne peuvent faire plus de 16 caractères.

source: Variable range must be one of: %s, %s
fr: L'intervalle d'une variable doit être %s ou %s

source: Variable length (%s) or initial value (%s) is not in the valid range.
fr: La taille (%s) de la variable ou sa valeur initiale (%s) n'est pas valide.

source: Not enough room for %s more variable(s) of type %s.
fr: Espace disponible trop petit pour %s variable(s) de type %s supplémentaires.

source: Error editing variable.
fr: Erreur à l'édition de la variable.

source: Error - Can not change the range of a variable that is
fr: Erreur - La plage d'une variable utilisée par

source: being used in the program.
fr: le programme ne peut être modifié.

source: Can't change the range.
fr: La plage ne peut être modifiée.

source: Can not delete the variable as it is used in the program.
fr: La variable ne peut être supprimée car elle est utilisée par le programme.

source: Delete it from the program before deleting it here.
fr: Supprimer la du programme avant de la supprimer ici.

source: Can't delete variable.
fr: La variable ne peut être supprimée.

source: Variable name:
fr: Nom de la variable:

source: Variable range:
fr: Plage de la variable:

source: Initial value (optional):
fr: Valeur initiale (optionnel):

source: Data:
fr: Données :

source: Pdata Version:
fr: Version Pdata :

source: Advanced:
fr: Avancé :

source: Windows:
fr: Fenêtres :

source: Version of data in file '%s' doesn't match this version of Bricworks.
fr: La version des données dans le fichier '%s' ne correspond pas à cette version de Bricworks.

source: Version Mismatch - can't load program
fr: Incohérence de version - le programme ne peut être chargé

source: Version of data in file '%s'
fr: Version des données du fichier '%s'

source: doesn't match this version of Bricworks.
fr: ne correspond pas à la version de Bricworks.

source: You may try anyway, or CANCEL to abort the file open.
fr: Vous pouvez essayer ou Annuler pour arrêter l'ouverture du fichier.

source: Version Mismatch Warning
fr: Avertissement d'incohérence de versions

source: Error - unknown name:
fr: Erreur - nom inconnu :

source: Error - window %s has not been registered
fr: Erreur - la fenêtre %s n'est pas enregistrée

source: Restoring properties to previous values because:
fr: Restauration des propriétés à leur valeur précédente à cause de :

source: Error in constant
fr: Erreur dans la constante

source: Time value '%s' isn't valid.
fr: La valeur du temps '%s' n'est pas valide.

source: Time can't be negative
fr: Le temps ne peut pas être négatif.

source: Time value is greater then 327.67 seconds
fr: Le temps ne peut pas être plus grand que 327,67 secondes

source: Invalid transmit character: %s. Must be a character or 0xhh where h is a hex digit.
fr: Caractère transmis invalide : %s. Il doit être un caractère ou 0xhh où h est un chiffre hexadécimal.

source: LCD character '%s' is out of range
fr: LCD caractère '%s' est en dehors de l'intervalle

source: (upper-case, digits and some punctuation are valid)
fr: (majuscule, chiffres et certaines ponctuations sont valides)

source: There must be exactly one character
fr: Il ne peut y avoir qu'un unique caractère

source: LCD string would overflow the LCD screen
fr: La chaine de caractère LCD est trop grand pour l'écran LCD

source: Empty number
fr: Nombre vide

source: Number %d is outside of the range: 0 -> 255
fr: Le nombre %d est en dehors de l'intervalle : 0 -> 255

source: Number %d is outside of the range: -32767 -> +32767
fr: Le nombre %d est en dehors de l'intervalle : -32767 -> +32767

source: Invalid number:
fr: Nombre invalide :

source: Number %s is less than minimum %s
fr: Le nombre %s est plus petit que le minimum %s

source: Number %s is greater than maximum %s
fr: Le nombre %s est plus grand que le maximum %s

source: You are placing a motor at the (%d, %d) corner.
fr: Vous placez un moteur dans le coin (%d, %d).

source: Corner motor orientation.
fr: Orientation du moteur dans le coin.

source: icon?
fr: icône?

source: Do you want to delete the
fr: Voulez-vous supprimer le

source: Delete check
fr: Vérification de la suppression
